---
kind: property
id: P:Autodesk.Revit.DB.CurtainCell.CurveLoops
source: html/f47e5418-42e4-75c4-4d63-f2f7fca639f9.htm
---
# Autodesk.Revit.DB.CurtainCell.CurveLoops Property

The cell boundaries on the reference face. The boundaries can have more than one CurveLoop. Each item in the returned array represents a CurveLoop containing 3 or more than 3 edges.

## Syntax (C#)
```csharp
public CurveArrArray CurveLoops { get; }
```